#---------------- 메뉴 명 딕셔너리 ---------------------
menu = {'김밥(도시락)':'Genrestrtlunch', '카페':'Genrestrtcate', '중식':'Genrestrtchifood',
        '일식':'Genrestrtjpnfood','탕':'Genrestrtsoup','회':'Genrestrtsash',
        '패스트푸드':'Genrestrtfastfood','뷔페':'Genrestrtbuff'}
menulist = list(menu.keys())

#---------------- 시군 명, 시군 코드 ---------------------
isFullSiGun = False                 # 시군 리스트가 채워졌는지
l_SIGUN = []                        # 시군명 정보(key)현재



# Gyeonggi = {'고양시':0,'수원시':1,'용인시':2,'과천시':3,'광명시':4,'광주시':5,'구리시':6,
#             '군포시':7,'김포시':8,'남양주시':9,'동두천시':10,'부천시':11,'성남시':12 ,
#             '시흥시':13 ,'안산시':13 ,'안성시':14 ,'안양시':15 ,'양주시':16 ,'여주시':17 ,
#             '오산시':18 ,'의왕시':19 ,'의정부시':20 ,'이천시':21 ,'파주시':22 ,'평택시':23 ,
#             '포천시':24 ,'하남시':25 ,'화성시':26,'가평군':27,'양평군':28,'연천군':29, '서울특별':30}
# l_SIGUN = list(Gyeonggi.keys())
# menu_num = {'김밥(도시락)':0, '카페':1, '중식':2,
#         '일식':3,'탕':4,'회':5,
#         '패스트푸드':6,'뷔페':7}

#---------------- tkinter에서 현재 가리키고 있는 시군명, 메뉴명 ---------------------
current_SIGUN = '시흥시'
current_menu = menulist[0]


